ppl.org
#+title: Principles of Programming Languages (לחיל האויר)
#+author: Mayer Goldberg
#+email: gmayer@little-lisper.org
#+options: creator:nil, h:7
#+keywords: Mayer Goldberg, Department of Computer Science, Ben-Gurion University, programming languages, PPL, interpretation, compilation, interpreters, compilers, semantics, functional programming, Scheme, ML

* Staff
| Lecturer    | [[home][/Mayer Goldberg/]] |
| TA & Grader | [[mailto://mari@bgu.ac.il][/Azzam Mari/]]     |

* Topics

- Abstraction in programming languages
- Functional programming in Scheme
- Side effects & state
- Interpretation
- Control
- Parameter-passing mechanisms
- Scope
- Order of evaluation
- Type theory

* Languages used in the course

- Scheme

* Literature

- Misc sources, given as PDF files, that shall be made available to
  you in class and by email. 

* Files
- [[ws-file:20120809-ppl-handout.scm][Examples of using Scheme]]
- [[ws-file:locally-defined-procedures.pdf][Handout on locally-defined procedures in Scheme]]

* Coursework

- Assignment 1 (due Aug 15 at 23:00) from /The Little Lisper/:
  - Page 58, problems 3.1, 3.2, 3.3
  - Page 59, problems 3.5, 3.6, 3.9
- Assignment 2 (due Aug 26 at 23:00) from /The Little Lisper/:
  - Page 82, problems 4.1, 4.2
  - Page 83, problems 4.5, 4.6, 4.7
  - Page 83, problem 4.8 --- call your procedure =idiv=
  - Page 83, problem 4.10 --- call your procedure =leq=
  - Page 93, problem 5.3
  - Page 94, problems 5.4, 5.5
- Assignment 3 (due Sep 10 at 23:00) from /The Little Lisper/:
  - Page 111, problems 6.1, 6.2, 6.3
  - Page 112, problem 6.6
  - Page 131, problems 7.2, 7.3, 7.4
  - Page 147, problems 8.1, 8.2
  - Page 148, problems 8.3, 8.4, 8.5, 8.6
  - Page 149, problems 8.7, 8.9
- Assignment 4
- Assignment 5
- Assignment 6

You shall be getting regular assignments. These will be posted
here. You shall hand them in by emailing them to [[mailto://mari@bgu.cs.bgu.ac.il][/Azzam Mari/]].

* How your grade is computed

| /             |   <> |
|---------------+------|
| Weekly quizes |  20% |
| Assignments   |  20% |
| Final exam    |  60% |
|---------------+------|
| TOTAL         | 100% |
|---------------+------|


* Policies
- Attendance is mandatory. If you miss three classes throughout the semester, you are not allowed to take the final exam.
  - If you leave the class in the middle of the lecture, for more than several minutes, this constitutes absence for the purpose of these policies.
- You may work on your assignments in groups of size 2 (or less). You may not work in larger groups. 
