ppl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Principles of Programming Languages (לחיל האויר)</title>
<!-- 2013-08-06 Tue 22:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="keywords" content="Mayer Goldberg, Department of Computer Science, Ben-Gurion University, programming languages, PPL, interpretation, compilation, interpreters, compilers, semantics, functional programming, Scheme, ML"/>
<link rel="icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.ico" />
<link rel="apple-touch-icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.png" />
</head>
<body>
<div id="content">
<h1 class="title">Principles of Programming Languages (לחיל האויר)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Staff</a></li>
<li><a href="#sec-2">2. Topics</a></li>
<li><a href="#sec-3">3. Languages used in the course</a></li>
<li><a href="#sec-4">4. Literature</a></li>
<li><a href="#sec-5">5. Files</a></li>
<li><a href="#sec-6">6. Coursework</a></li>
<li><a href="#sec-7">7. How your grade is computed</a></li>
<li><a href="#sec-8">8. Policies</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Staff</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Lecturer</td>
<td class="left"><a href="http://www.little-lisper.org/website/"><i>Mayer Goldberg</i></a></td>
</tr>

<tr>
<td class="left">TA &amp; Grader</td>
<td class="left"><a href="mailto://mari@bgu.ac.il"><i>Azzam Mari</i></a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Topics</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Abstraction in programming languages
</li>
<li>Functional programming in Scheme
</li>
<li>Side effects &amp; state
</li>
<li>Interpretation
</li>
<li>Control
</li>
<li>Parameter-passing mechanisms
</li>
<li>Scope
</li>
<li>Order of evaluation
</li>
<li>Type theory
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Languages used in the course</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Scheme
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Literature</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Misc sources, given as PDF files, that shall be made available to
you in class and by email. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Files</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://www.little-lisper.org/website/files/20120809-ppl-handout.scm">Examples of using Scheme</a>
</li>
<li><a href="http://www.little-lisper.org/website/files/locally-defined-procedures.pdf">Handout on locally-defined procedures in Scheme</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Coursework</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Assignment 1 (due Aug 15 at 23:00) from <i>The Little Lisper</i>:
<ul class="org-ul">
<li>Page 58, problems 3.1, 3.2, 3.3
</li>
<li>Page 59, problems 3.5, 3.6, 3.9
</li>
</ul>
</li>
<li>Assignment 2 (due Aug 26 at 23:00) from <i>The Little Lisper</i>:
<ul class="org-ul">
<li>Page 82, problems 4.1, 4.2
</li>
<li>Page 83, problems 4.5, 4.6, 4.7
</li>
<li>Page 83, problem 4.8 &#x2014; call your procedure <code>idiv</code>
</li>
<li>Page 83, problem 4.10 &#x2014; call your procedure <code>leq</code>
</li>
<li>Page 93, problem 5.3
</li>
<li>Page 94, problems 5.4, 5.5
</li>
</ul>
</li>
<li>Assignment 3 (due Sep 10 at 23:00) from <i>The Little Lisper</i>:
<ul class="org-ul">
<li>Page 111, problems 6.1, 6.2, 6.3
</li>
<li>Page 112, problem 6.6
</li>
<li>Page 131, problems 7.2, 7.3, 7.4
</li>
<li>Page 147, problems 8.1, 8.2
</li>
<li>Page 148, problems 8.3, 8.4, 8.5, 8.6
</li>
<li>Page 149, problems 8.7, 8.9
</li>
</ul>
</li>
<li>Assignment 4
</li>
<li>Assignment 5
</li>
<li>Assignment 6
</li>
</ul>

<p>
You shall be getting regular assignments. These will be posted
here. You shall hand them in by emailing them to <a href="mailto://mari@bgu.cs.bgu.ac.il"><i>Azzam Mari</i></a>.
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> How your grade is computed</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>
</colgroup>

<colgroup>
<col class="right"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Weekly quizes</th>
<th scope="col" class="right">20%</th>
</tr>

<tr>
<th scope="col" class="left">Assignments</th>
<th scope="col" class="right">20%</th>
</tr>

<tr>
<th scope="col" class="left">Final exam</th>
<th scope="col" class="right">60%</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">TOTAL</td>
<td class="right">100%</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Policies</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Attendance is mandatory. If you miss three classes throughout the semester, you are not allowed to take the final exam.
<ul class="org-ul">
<li>If you leave the class in the middle of the lecture, for more than several minutes, this constitutes absence for the purpose of these policies.
</li>
</ul>
</li>
<li>You may work on your assignments in groups of size 2 (or less). You may not work in larger groups. 
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mayer Goldberg</p>
<p class="date">Created: 2013-08-06 Tue 22:18</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>